UB_Copy/src/Documents/УБ_УтверждениеГрейда/УБ_УтверждениеГрейда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБ_УтверждениеГрейда</name>
  <basedOn>Document.УБ_УтверждениеГрейда</basedOn>
  <registerRecords>InformationRegister.УБ_УстановленныеШкалыПоказателей</registerRecords>
  <registerRecords>InformationRegister.УБ_РасценкиПоказателейЭффективности</registerRecords>
  <registerRecords>InformationRegister.УБ_ФормулыПоказателейЭффективности</registerRecords>
  <registerRecords>InformationRegister.УБ_ВерсииГрейдов</registerRecords>
  <registerRecords>InformationRegister.УБ_СоставСтандартовМоделейПланирования</registerRecords>
  <registerRecords>InformationRegister.УБ_СоставПоказателейМоделейПланирования</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияГрейда</name>
    <type>
      <types>CatalogRef.УБ_ВерсииГрейдов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаПремии</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаПремии</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчетаЗарплатыПриБезокладнойСистеме</name>
    <type>
      <types>DefinedType.УБ_ПоказателиРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.УБ_СтатусыМоделейПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаМоделиПланирования</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>АктуальнаяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредельныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Матричный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ПоказательЭффективности</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаПоказателей</name>
      <type>
        <types>CatalogRef.УБ_ШкалыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КритическоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаИзменена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасценки</name>
      <type>
        <types>EnumRef.УБ_ВидыРасценокПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитыватьРезультатОтФакта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Фиксированный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НегативноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПозитивноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьРасчета</name>
      <type>
        <types>EnumRef.УБ_ПериодичностьРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграничиватьМинимальноеЗначениеРезультата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграничиватьМаксимальноеЗначениеРезультата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стандарты</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.УБ_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаОценок</name>
      <type>
        <types>CatalogRef.УБ_ШкалыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормулыРасчета</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательЭффективности</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыПоказателей</name>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ШкалыПоказателей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПериодыИспользованияПоказателей</name>
    <attributes>
      <name>ПоказательЭффективности</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UB_Copy/src/Enums/УБ_СтатусыМоделейПланирования/УБ_СтатусыМоделейПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_СтатусыМоделейПланирования</name>
  <enumValues>
    <name>Планируется</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Неактуальный</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/Enums/УБ_ТипыРасчета/УБ_ТипыРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_ТипыРасчета</name>
  <enumValues>
    <name>Прямой</name>
  </enumValues>
  <enumValues>
    <name>Обратный</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/Documents/УБ_УтверждениеГрейда/Forms/ФормаПараметров/Module.bsl
&НаКлиенте
Процедура ПеренестиИЗакрыть(Команда)
	
	
	ДопПараметры = СформироватьДопПараметры();
	
	Закрыть(ДопПараметры);
	
КонецПроцедуры

&НаСервере
Функция СформироватьДопПараметры()
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Показатель", Показатель);
	ДопПараметры.Вставить("ТипПоказателя", ТипПоказателя);
	ДопПараметры.Вставить("КритическоеЗначение", КритическоеЗначение);
	ДопПараметры.Вставить("ВидРасценки",ВидРасценки);
	ДопПараметры.Вставить("РассчитыватьРезультатОтФакта", РассчитыватьРезультатОтФакта);
	ДопПараметры.Вставить("Фиксированный", Фиксированный);
	ДопПараметры.Вставить("НегативноеОтклонениеНормыДо", НегативноеОтклонениеНормыДо);
	ДопПараметры.Вставить("ПограничноеОтклонениеНормыДо", ПограничноеОтклонениеНормыДо);
	ДопПараметры.Вставить("ПограничноеОтклонениеНормыОт", ПограничноеОтклонениеНормыОт);
	ДопПараметры.Вставить("ПозитивноеОтклонениеНормыОт", ПозитивноеОтклонениеНормыОт);
	ДопПараметры.Вставить("Формула", Формула);
	ДопПараметры.Вставить("ФормулаИзменена", ФормулаИзменена);
	ДопПараметры.Вставить("МассивФормул", ПолучитьМассивФормул());
	ДопПараметры.Вставить("МассивЯчеек", ПолучитьМассивЯчеек());
	ДопПараметры.Вставить("ШкалаПоказателя", ШкалаПоказателя);
	ДопПараметры.Вставить("ПериодичностьРасчета", ПериодичностьРасчета);
	ДопПараметры.Вставить("МассивМесяцев", ПолучитьМассивМесяцев());
	ДопПараметры.Вставить("ОграничиватьМинимальноеЗначениеРезультата", ОграничиватьМинимальноеЗначениеРезультата);
	ДопПараметры.Вставить("ОграничиватьМаксимальноеЗначениеРезультата", ОграничиватьМаксимальноеЗначениеРезультата);
	ДопПараметры.Вставить("МинимальноеЗначение", МинимальноеЗначение);
	ДопПараметры.Вставить("МаксимальноеЗначение", МаксимальноеЗначение);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивФормул()
	
	МассивФормул = Новый Массив;
	Для каждого Строка из Формулы Цикл
		МассивФормул.Добавить(Строка.Формула);
	КонецЦикла;	
	
	Возврат МассивФормул;
	
КонецФункции	

&НаСервере
Функция ПолучитьМассивЯчеек()
	
	МассивЯчеек = Новый Массив;
	Для каждого Строка из Формулы Цикл
		МассивЯчеек.Добавить(Строка.Ячейка);
	КонецЦикла;	
	
	Возврат МассивЯчеек;
	
КонецФункции	

&НаСервере
Функция ПолучитьМассивМесяцев()
	
	МассивМесяцев = Новый Массив;
	Если Январь Тогда
		МассивМесяцев.Добавить(Дата("20010101"));
	КонецЕсли;	
	Если Февраль Тогда
		МассивМесяцев.Добавить(Дата("20010201"));
	КонецЕсли;	
	Если Март Тогда
		МассивМесяцев.Добавить(Дата("20010301"));
	КонецЕсли;	
	Если Апрель Тогда
		МассивМесяцев.Добавить(Дата("20010401"));
	КонецЕсли;	
	Если Май Тогда
		МассивМесяцев.Добавить(Дата("20010501"));
	КонецЕсли;	
	Если Июнь Тогда
		МассивМесяцев.Добавить(Дата("20010601"));
	КонецЕсли;	
	Если Июль Тогда
		МассивМесяцев.Добавить(Дата("20010701"));
	КонецЕсли;	
	Если Август Тогда
		МассивМесяцев.Добавить(Дата("20010801"));
	КонецЕсли;	
	Если Сентябрь Тогда
		МассивМесяцев.Добавить(Дата("20010901"));
	КонецЕсли;	
	Если Октябрь Тогда
		МассивМесяцев.Добавить(Дата("20011001"));
	КонецЕсли;	
	Если Ноябрь Тогда
		МассивМесяцев.Добавить(Дата("20011101"));
	КонецЕсли;	
	Если Декабрь Тогда
		МассивМесяцев.Добавить(Дата("20011201"));
	КонецЕсли;	

	
	Возврат МассивМесяцев;
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УБ_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма,Отказ,СтандартнаяОбработка);
	
	ЗаполнитьФормуИзПараметров();
	Если Параметры.Свойство("ДопПараметры") Тогда
		Заголовок = "Дополнительные параметры";
		Элементы.ДополнительныеПараметры.Видимость = Параметры.ДопПараметры;
		Элементы.ОсновныеПараметры.Видимость = Не Параметры.ДопПараметры;
		Если Параметры.УровеньГруппировки = 0 Тогда
			Элементы.ГруппаПериодичность.Видимость = Ложь;
			Элементы.ГруппаОграничения.Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;
	Если Параметры.Свойство("ОснПараметры") Тогда
		Заголовок = "Основные параметры";
		Элементы.ОсновныеПараметры.Видимость = Параметры.ОснПараметры;
		Элементы.ДополнительныеПараметры.Видимость = Не Параметры.ОснПараметры;
		Если Параметры.ТипПоказателя.Матричный Тогда
			Элементы.ГруппаНастройкиРасценки.Видимость = Ложь;	
		КонецЕсли;	
	КонецЕсли;
	
	ТолькоПросмотрФормы = (Параметры.Статус = ПредопределенноеЗначение("Перечисление.УБ_СтатусыМоделейПланирования.Действует"));
	Элементы.ДополнительныеПараметры.ТолькоПросмотр = ТолькоПросмотрФормы;
	Элементы.ОсновныеПараметры.ТолькоПросмотр = ТолькоПросмотрФормы;
	
	Элементы.ФормаПеренестиИЗакрыть.Доступность = НЕ ТолькоПросмотрФормы;
	
	Элементы.КритическоеЗначение.ТолькоПросмотр = (ТипРасчета = ПредопределенноеЗначение("Перечисление.УБ_ТипыРасчета.Прямой"));

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//++Графика
	Если Элементы.Найти("КИндикатор") <> Неопределено Тогда
		типПрямой = УБ_СобытияФормКлиент.ТипРасчетаПрямой(ТипРасчета);
		УБ_ПользовательскийИнтерфейсКлиент.СменаНаправленияИндикаторовГНЭ(Элементы.КИндикатор, Элементы.ЗИндикатор, типПрямой);
	КонецЕсли;
	//--Графика
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуИзПараметров()
	
	Если Параметры.Свойство("Показатель") Тогда
		Показатель = Параметры.Показатель;
		ТипПоказателя = Параметры.ТипПоказателя;
		
		Если ЗначениеЗаполнено(ТипПоказателя) Тогда
			ПоказательУтвержденияСтандартов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипПоказателя,"ПоказательУтвержденияСтандартов");
			ТипРасчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПоказательУтвержденияСтандартов, "ТипРасчета");
		Иначе
			ПоказательУтвержденияСтандартов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Показатель,"ПоказательУтвержденияСтандартов");
			ТипРасчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПоказательУтвержденияСтандартов, "ТипРасчета");
		КонецЕсли;	
		
		КритическоеЗначение = Параметры.КритическоеЗначение;	
		ВидРасценки = Параметры.ВидРасценки;	
		РассчитыватьРезультатОтФакта = Параметры.РассчитыватьРезультатОтФакта;	
		Фиксированный = Параметры.Фиксированный;	
		НегативноеОтклонениеНормыДо = Параметры.НегативноеОтклонениеНормыДо;	
		ПограничноеОтклонениеНормыОт = Параметры.ПограничноеОтклонениеНормыОт;	
		ПограничноеОтклонениеНормыДо = Параметры.ПограничноеОтклонениеНормыДо;	
		ПозитивноеОтклонениеНормыОт = Параметры.ПозитивноеОтклонениеНормыОт;
		ФормулаИзменена = Параметры.ФормулаИзменена;	
		ШкалаПоказателя = Параметры.ШкалаПоказателя;	
		Формула = Параметры.Формула;	
		ПериодичностьРасчета = Параметры.ПериодичностьРасчета;
		МаксимальноеЗначение = Параметры.МаксимальноеЗначение;	
		МинимальноеЗначение = Параметры.МинимальноеЗначение;
		ЗаполнитьФормулы();
		ЗаполнитьМесяцаИспользования();
		ЗаполнитьРазрешенныеПоказатели();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормулы()
	
	Номер = 0;	
	Пока Номер<Параметры.МассивФормул.Количество() Цикл
	    НоваяСтрока = Формулы.Добавить();
		НоваяСтрока.Ячейка = Параметры.МассивЯчеек[Номер];
		НоваяСтрока.Формула = Параметры.МассивФормул[Номер];
		Номер = Номер+1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМесяцаИспользования()
	
	Для каждого СтрокаПериода из Параметры.МассивМесяцев Цикл
		Если Месяц(СтрокаПериода) = 1 Тогда
			Январь = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 2 Тогда
			Февраль = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 3 Тогда
			Март = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 4 Тогда
			Апрель = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 5 Тогда
			Май = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 6 Тогда
			Июнь = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 7 Тогда
			Июль = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 8 Тогда
			Август = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 9 Тогда
			Сентябрь = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 10 Тогда
			Октябрь = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 11 Тогда
			Ноябрь = Истина;
		КонецЕсли;
		
		Если Месяц(СтрокаПериода) = 12 Тогда
			Декабрь = Истина;
		КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьРазрешенныеПоказатели()
	
	Для каждого строка из Параметры.РазрешенныеПоказатели Цикл
		РазрешенныеПоказатели.Добавить(Строка);
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Функция СформироватьСтруктуруИзмененияФормулы(ЗначениеЗаполнено)
	Результат = Новый Структура();
	Результат.Вставить("СписокДоступныхПоказателей",СобратьМассивДоступныхЗначений());
	Результат.Вставить("НаименованиеПоказателя", Строка(Показатель));
	Результат.Вставить("ПоказательЭффективности", Показатель);
	Результат.Вставить("ТолькоПросмотр", ТолькоПросмотрФормы);
	
	Если ЗначениеЗаполнено Тогда
		СФормироватьСписокФормул(Результат);
	Иначе
		Результат.Вставить("Формула", Формула);
	КонецЕсли;
		
	возврат Результат;
КонецФункции

&НаКлиенте
Процедура ИзменитьФормулу(Команда)
	
	ЗначениеЗаполнено = ЗначениеЗаполнено(ТипПоказателя);
	ПараметрыФормы = СформироватьСтруктуруИзмененияФормулы(ЗначениеЗаполнено);
	
	Если ЗначениеЗаполнено Тогда
		
		ИмяПроцедуры = "ЗафиксироватьФормулыРасчета";
		ИмяОткрываемойФормы = "ОбщаяФорма.УБ_ФормаПодбораФормулРасчета";
		
	Иначе
		
		ИмяПроцедуры = "ЗафиксироватьФормулуРасчетаЗавершение";
		ИмяОткрываемойФормы = "ОбщаяФорма.УБ_РедактированиеФормулыПоказателВУтвержденииММ";
		
	КонецЕсли;		
	
	Оповещение = Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект, Показатель);
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, ЭтотОбъект,,,,
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьФормулыРасчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Формулы.Очистить();
			
	н = 0;	
	Пока н<Результат.МассивФормул.Количество() Цикл
	    НоваяСтрока = Формулы.Добавить();
		НоваяСтрока.Ячейка = Результат.МассивЯчеек[н];
		НоваяСтрока.Формула = Результат.МассивФормул[н];
		н = н+1;
	КонецЦикла;
	
	ЗаполнитьНадписиФормулРасчета();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНадписиФормулРасчета()
	
	Если ФормулыРавны(Формулы,Показатель) Тогда
		ФормулаИзменена = Ложь;
	Иначе	
		ФормулаИзменена = Истина;
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Функция ФормулыРавны(Формулы,Показатель)
	
	Равны = Истина;
	Если ТипЗнч(Показатель) = Тип("СправочникСсылка.УБ_ПоказателиЭффективности") Тогда
		Если Формулы.Количество() = Показатель.ФормулыРасчета.Количество() Тогда
			Для каждого Строка из Формулы Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Ячейка",Строка.Ячейка);
				Отбор.Вставить("Формула",Строка.Формула);
				Если Показатель.ФормулыРасчета.НайтиСтроки(Отбор).Количество() = 0 Тогда
					Равны = Ложь;	
				КонецЕсли;
			КонецЦикла;
		Иначе
			Равны = Ложь;
		КонецЕсли;
	Иначе
		Если Не Формулы = Показатель.ФормулаРасчета Тогда
			Равны = Ложь;	
		КонецЕсли;	
	КонецЕсли;
	Возврат Равны;
	
КонецФункции

&НаКлиенте
Процедура ЗафиксироватьФормулуРасчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Формула = Результат.Формула;
	
	ЗаполнитьНадписиФормулРасчета();
	
КонецПроцедуры	

&НаСервере
Функция СобратьМассивДоступныхЗначений()
	
	МассивПоказателей = Новый Массив;
	Для каждого Строка из РазрешенныеПоказатели Цикл
		МассивПоказателей.Добавить(Строка.Значение);
	КонецЦикла;	
	
	Возврат МассивПоказателей; 
	
КонецФункции	

&НаСервере
Процедура СФормироватьСписокФормул(ПараметрыФормы)
	
	МассивФормул = Новый Массив;
	МассивЯчеек = Новый Массив;
	Для каждого Строка из Формулы Цикл
		МассивЯчеек.Добавить(Строка.Ячейка);
		МассивФормул.Добавить(Строка.Формула);
	КонецЦикла;
	
	ПараметрыФормы.Вставить("МассивФормул", МассивФормул);
	ПараметрыФормы.Вставить("МассивЯчеек", МассивЯчеек);
	
КонецПроцедуры	

&НаКлиенте
Процедура ШкалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПоказательЭффективности", Показатель);
	
	Оповещение = Новый ОписаниеОповещения("ЗафиксироватьШкалуПоказателяЗавершение", ЭтотОбъект,Показатель);
	
	ОткрытьФорму("Документ.УБ_УтверждениеГрейда.Форма.ФормаПодбораШкалы", ПараметрыФормы,ЭтотОбъект,,,,
		Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьШкалуПоказателяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШкалаПоказателя = Результат.ШкалаПоказателя;
	
КонецПроцедуры	

#Область ИзменениеГраницНормЭффективности
&НаКлиенте
Процедура ИзменениеГраницыПоказателей(Элемент, Пограничное)
	Структура = УБ_СобытияФормКлиент.СформироватьСтруктуру();
	ЗаполнитьЗначенияСвойств(Структура, ЭтотОбъект);
	Структура.ТипРасчета = ТипРасчета;
	
	УБ_СобытияФормКлиент.ИзменениеЗначенияОтклонения(Структура,Элемент, Пограничное);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Структура);
КонецПроцедуры


&НаКлиенте
Процедура НегативноеОтклонениеНормыДоПриИзменении(Элемент)
	ИзменениеГраницыПоказателей(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПограничноеОтклонениеНормыОтПриИзменении(Элемент)
	ИзменениеГраницыПоказателей(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПограничноеОтклонениеНормыДоПриИзменении(Элемент)
	ИзменениеГраницыПоказателей(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПозитивноеОтклонениеНормыОтПриИзменении(Элемент)
	ИзменениеГраницыПоказателей(Элемент, Ложь);
КонецПроцедуры

#КонецОбласти
